console.log('Scrip connected!');

const arrayOfLoveWishes = [
    "Бажаю безмежного кохання і щастя",  //0
    "Нехай серце наповниться любов’ю",  //1
    "Кохання, радості та яскравих емоцій", //2 
    "Нехай здійсняться всі романтичні мрії",  //3
    "Бажаю тепла, ніжності та гармонії",  //4
    "Хай любов завжди зігріває серце",  //5
    "Щастя, миру та справжнього кохання",  //6
    "Нехай у серці завжди буде весна",  //7
    "Бажаю щасливих і закоханих моментів", //8 
    "Нехай романтика буде в кожному дні",  //9
    "Любові, радості та приємних сюрпризів",  //10
    "Хай кохання окрилює і надихає",  //11
    "Щирих почуттів і незабутніх емоцій", //12 
    "Нехай любов дарує силу і світло",  //13
    "Справжнього щастя в обіймах коханих",  //14
    "Нехай серце співає від любові",  //15
    "Тепла, ніжності і гарних вражень",  //16
    "Кохання, яке робить життя яскравішим",  //17
    "Щирих почуттів і багато обіймів",  //18
    "Хай любов завжди буде поруч"//19
  ];
  

document.getElementById('Wishes_btn').addEventListener('click' , () => {

  console.log('Button clicked!');
    
    let index = Math.floor(Math.random() * arrayOfLoveWishes.length)
    
  console.log('Номер елементу масиву:', index);

    document.getElementById('p_Wishes').innerText = arrayOfLoveWishes[index];   

})
